# language: ru

# Тестовые данные:

Функция: JDBC


  Сценарий: Добавление фрукта в БД
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |
    * к БД выполняется запрос "Добавление товара" c параметрами:
      | field       | value |
      | food_id     | 5     |
      | food_name   | Банан |
      | food_type   | Фрукт |
      | food_exotic | 1     |
    * к БД выполняется запрос "Список товаров"
    * количество элементов коллекции "Список товаров" равно "5"
    * к БД выполняется запрос "Удаление товара по ID" c параметрами:
      | field   | value |
      | food_id | 5     |
    * закрыто подключение к БД


  Сценарий: Добавление овоща в БД
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |
    * к БД выполняется запрос "Добавление товара" c параметрами:
      | field       | value    |
      | food_id     | 5        |
      | food_name   | Картошка |
      | food_type   | Овощ     |
      | food_exotic | 0        |
    * к БД выполняется запрос "Список товаров"
    * количество элементов коллекции "Список товаров" равно "5"
    * к БД выполняется запрос "Удаление товара по ID" c параметрами:
      | field   | value |
      | food_id | 5     |
    * закрыто подключение к БД


