# language: ru

# Тестовые данные:

Функция: JDBC


  Сценарий: Добавление в БД некорректных значений
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |
    * Введены некорректные данные:
      | 5 | null   | null  | 12 |
      | 1 | Яблоко | FRUIT | 0  |
      | 1 | Банан  | FRUIT | 12 |
      | 1 | Банан  | null  | 0  |
      | 5 | Банан  | null  | 0  |
      | 5 | Банан  | FRUIT | 12 |
      | 1 | null   | FRUIT | 0  |
      | 5 | null   | FRUIT | 0  |
    * закрыто подключение к БД


  Сценарий: Добавление в БД корректных значений
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |
    * к БД выполняется запрос "Добавление товара" c параметрами:
      | field       | value |
      | food_id     | 5     |
      | food_name   | Банан |
      | food_type   | Фрукт |
      | food_exotic | 0     |
    * к БД выполняется запрос "Удвление товара по ID" c параметрами:
      | field   | value |
      | food_id | 5     |
    * закрыто подключение к БД
