# language: ru


Функция: Добавление товара

  Предыстория:
    * страница "Главная страница" загружена



  Структура сценария: Test Scenario structure
    * кнопка "Песочница" видима
    * выполнено нажатие на "Песочница"
    * нажатием на кнопку "Товары" загружена страница "Список товаров"
    * страница "Список товаров" загружена
    * количество элементов коллекции "Таблица" равно "<До>"
    * кнопка "Добавить" видима
    * нажатием на кнопку "Добавить" загружена страница "Добавление товара"
    * поле "Наименование" видимо
    * заполняются поля:
      | field        | value          |
      | Наименование | <Наименование> |
      | Тип          | <Тип>          |
      | Экзотический | <Экзотический> |
    * кнопка "Сохранить" видима
    * выполнено нажатие на "Сохранить"
    * страница "Список товаров" загружена
    * ожидается элемент коллекции "Таблица" в течение "10" секунд с параметрами:
      | field        | value          |
      | Наименование | <Наименование> |
      | Тип          | <Тип>          |
      | Экзотический | <Экзотический> |
    * количество элементов коллекции "Таблица" равно "<После>"

    * сохранить скриншот "Конец теста"
    Примеры:
      | Наименование | Тип   | Экзотический | До | После |
      | Картошка     | Овощ  | false        | 4  | 5     |
      | Манго        | Фрукт | true         | 5  | 6     |


      

