# language: ru

@addproduct
Функция: Добавление товара



  Предыстория:
    * Открыта страница по адресу "http://localhost:8080/"


  @product @veg
  @CucumberTest=1
  Сценарий: Добавление овоща в БД
    * Кнопка "Меню" видима
    * Выполнено нажатие на "Меню"
    * Кнопка "Товары" видима
    * Выполнено нажатие на "Товары"
    * Открыта страница "Товары"
    * Кнопка "Добавить" видима
    * Выполнено нажатие на "Добавить"
    * Открыта страница "Добавление товара"
    * Поле "Наименование" видимо
    * Поле "Наименование" заполняется значением "Картошка"
    * Селектор "Тип продукта" виден
    * Из опций селектора выбираем "Овощ"
    * Чекбокс "Экзотический" виден
    Если Чекбокс "Экзотический" включен
    То Выключаем чекбокс "Экзотический"
    * Кнопка "Сохранить" видима
    * Выполнено нажатие на "Сохранить"
    * Поля добавленного товара соответствуют значениям:
      | Наименование | Картошка |
      | Тип          | Овощ     |
      | Экзотический | false    |

  @product @fruit
  @CucumberTest=2
  Сценарий: Добавление фрукта в БД
    * Кнопка "Меню" видима
    * Выполнено нажатие на "Меню"
    * Кнопка "Товары" видима
    * Выполнено нажатие на "Товары"
    * Открыта страница "Товары"
    * Кнопка "Добавить" видима
    * Выполнено нажатие на "Добавить"
    * Открыта страница "Добавление товара"
    * Поле "Наименование" видимо
    * Поле "Наименование" заполняется значением "Манго"
    * Селектор "Тип продукта" виден
    * Из опций селектора выбираем "Фрукт"
    * Чекбокс "Экзотический" виден
    Если Чекбокс "Экзотический" выключен
    То Включаем чекбокс "Экзотический"
    * Кнопка "Сохранить" видима
    * Выполнено нажатие на "Сохранить"
    * Поля добавленного товара соответствуют значениям:
      | Наименование | Манго |
      | Тип          | Фрукт |
      | Экзотический | true  |









